In [4]:
# Instalação das bibliotecas
import numpy as np
import pandas as pd

In [3]:
check = pd.Series(['alex','matthew','john','romain'])
check

0       alex
1    matthew
2       john
3     romain
dtype: object

In [4]:
check.map(lambda x:len(x))

0    4
1    7
2    4
3    6
dtype: int64

In [ ]:
#Series: one dim
# Dataframe: 2 dim, tabular/sql table/ csv or excel table etc

In [5]:
dt = pd.DataFrame()
dt

Empty DataFrame
Columns: []
Index: []

In [6]:
dt1 = [5,3,7,6,5,4]
dt2 = pd.DataFrame(dt1)
dt2

   0
0  5
1  3
2  7
3  6
4  5
5  4

In [7]:
data = [['alex',30],['matthew',45],['romain',56]]
dt3 = pd.DataFrame(data,columns=['name','age'])
dt3

      name  age
0     alex   30
1  matthew   45
2   romain   56

In [10]:
data = {'name':['tom', 'alan', 'jack', 'rosy'], 'age':[34,76,35,67]}
dt4 = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
dt4

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   35
rank4  rosy   67

In [11]:
#dataframes attributes
dt4.index

Index(['rank1', 'rank2', 'rank3', 'rank4'], dtype='object')

In [12]:
dt4.columns

Index(['name', 'age'], dtype='object')

In [13]:
dt4.dtypes

name    object
age      int64
dtype: object

In [14]:
dt4.shape

(4, 2)